app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "superman"], ["body", "wakokoko"], ["post_id", 7], ["created_at", "2018-03-11 15:22:57.562637"], ["updated_at", "2018-03-11 15:22:57.562637"]]
---
	def create
	    @post = Post.find(params[:post_id])
	    @comment = @post.comments.create(comment_params)