app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "summary", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "9999"], ["description", "8888"], ["summary", "7777"], ["created_at", "2018-03-11 14:41:24.080151"], ["updated_at", "2018-03-11 14:41:24.080151"], ["user_id", 4]]
---
	def create
		@post = current_user.posts.build(post_params)

		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "summary" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "111199"], ["description", "2222000"], ["summary", "3333888"], ["updated_at", "2018-03-11 16:10:30.047852"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(post_params)